Repository: drupalconnect/accuray
Catalog: modules/contrib/apply_for_role/translations/*.po
Languages: fi

source: Apply for role options
fi: Säädöt

source: Allow multiple roles per application
fi: Salli useiden roolipyyntöjen tekeminen yhdellä kertaa

source: No
fi: Ei

source: Yes
fi: Kyllä

source: Chosing 'no' will limit users to applying for only one role per role application. Choosing 'yes' will allow users to apply for multiple roles per role application.
fi: Valitsemalla 'Ei' asetat rajoituksen, ettei käyttäjä voi pyytää kuin yhden roolin kerrallaan. Valitsemalla 'Kyllä' sallit, että käyttäjä voi pyytää useampia rooleja samalla kertaa.

source: Apply for role on registration
fi: Pyydä roolia rekisteröityessä

source: Optional
fi: Valinnainen

source: Required
fi: Pakollinen

source: Choosing 'optional' will allow users to apply for roles when creating a new account. Choosing 'required' will require users to apply for roles when creating a new account.
fi: Valitsemalla 'Valinnainen' sallit, että käyttäjä voi pyytää rooleja luodessaan käyttäjätilin. Valitsemalla 'Pakollinen' määrittelet, että käyttäjän täytyy pyytää rooleja luodessaan käyttäjätilin.

source: Roles
fi: Roolit

source: Select the roles that users will be able to apply for.
fi: Valitse roolit, joita käyttäjät voivat pyytää.

source: Update
fi: Päivitä

source: Apply for role settings have been saved.
fi: Apply for role -moduulin asetukset on tallennettu.

source: Username
fi: Käyttäjänimi

source: Current Roles
fi: Nykyiset roolit

source: Applying For
fi: Pyytää roolia

source: Applied
fi: Pyyntö tehty

source: Status
fi: Tila

source: Processed
fi: Käsitelty

source: Operations
fi: Toiminnot

source: <em>Invalid Role</em>
fi: <em>Virheellinen rooli</em>

source: Approve
fi: Hyväksy

source: Approve this user
fi: Hyväksy tämä käyttäjä

source: Deny
fi: Hylkää

source: Deny this user
fi: Hylkää tämä käyttäjä

source: Delete
fi: Poista

source: Remove application
fi: Poista sovellus

source: There are currently no applications.
fi: Ei roolipyyntöjä

source: Do you want to approve the application from user %username for role %role
fi: Haluatko hyväksyä käyttäjän %username pyynnön roolille %role?

source: The role will be automatically assigned to the user.
fi: Rooli annetaan käyttäjälle.

source: The application was approved and the user was added to the role.
fi: Pyyntö hyväksyttiin ja käyttäjälle lisättiin rooli.

source: Error approving application. Please try again!
fi: Virhe pyynnön hyväksymisessä. Yritä uudelleen, ole hyvä.

source: Do you want to deny the application from user %username for role %role
fi: Haluatko hylätä käyttäjän %username pyynnön roolille %role?

source: The role will not be assigned to the user and the user will not be able to apply again.
fi: Roolia ei anneta käyttäjälle eikä käyttäjä voi pyytää roolia uudelleen.

source: The application was denied .
fi: Pyyntö hylättiin.

source: Error denying application. Please try again!
fi: Virhe pyynnön hylkäämisessä. Yritä uudelleen, ole hyvä.

source: Do you want to remove the application from user %username for role %role
fi: Haluatko poistaa käyttäjän %username pyynnön roolille %role?

source: Invalid role
fi: Virheellinen rooli

source: The role will be automatically deleted from the user and they will be allowed to re-apply for the role.
fi: Roolia ei myönnetä käyttäjälle, mutta käyttäjän sallitaan pyytää uudelleen roolia

source: The application was deleted.
fi: Pyyntö on poistettu.

source: Error deleting application. Please try again!
fi: Virhe pyynnön poistamisessa. Yritä uudelleen, ole hyvä.

source: Applicant's user ID
fi: Pyytäjän käyttäjätunnus

source: Applicant's user name
fi: Pyytäjän käyttäjänimi

source: Applicant's user name. WARNING - raw user input.
fi: Hakijan käyttäjänimi. VAROITUS: raakamuotoista käyttäjän antamaa syötettä.

source: Applicant's e-mail.
fi: Pyytäjän sähköpostiosoite

source: Applicant's e-mail. WARNING - raw user input.
fi: Hakijan sähköpostiosoite. VAROITUS: raakamuotoista käyttäjän antamaa syötettä.

source: Application role ID
fi: Pyynnön roolitunnus

source: Application role name
fi: Pyynnön roolinimi

source: Application status
fi: Pyynnön tila

source: Application creation year (four digit)
fi: Pyynnön luontivuosi (nelinumeroinen)

source: Application creation year (two digit)
fi: Pyynnön luontivuosi (kaksinumeroinen)

source: Application creation month (full word)
fi: Pyynnön luontikuukausi

source: Application creation month (abbreviated)
fi: Pyynnön luontikuukausi (lyhennettynä)

source: Application creation month (two digit, zero padded)
fi: Pyynnön luontikuukausi (kaksinumeroinen, 0 erottimena)

source: Application creation month (one or two digit)
fi: Pyynnön luontikuukausi (yksi- tai kaksinumeroinen)

source: Application creation week (two digit)
fi: Pyynnön luontiviikko (kaksinumeroinen)

source: Application creation date (day of month)
fi: Pyynnön luontipäivä (numeroin)

source: Application creation day (full word)
fi: Pyynnön luontipäivä

source: Application creation day (abbreviation)
fi: Pyynnön luontipäivä (lyhennetty)

source: Application creation day (two digit, zero-padded)
fi: Pyynnön luontipäivä (kaksinumeroinen, 0 erottimena)

source: Application creation day (one or two digit)
fi: Pyynnön luontipäivä (yksi- tai kaksinumeroinen)

source: Triggers are system events, such as when new content is added or when a user logs in. Trigger module combines these triggers with actions (functional tasks), such as unpublishing content or e-mailing an administrator. The <a href="@url">Actions settings page</a> contains a list of existing actions and provides the ability to create and configure additional actions.
fi: Triggerit ovat järjestelmätapahtumia, kuten uuden sisällön lisääminen tai käyttäjän kirjautuminen sisään. Trigger-moduuli yhdistää triggereitä toimintoihin (funktionaalisiin tehtäviin), kuten sisällön jättäminen julkaisematta tai sähköpostiviestin lähettäminen ylläpitäjälle. <a href="@url">Toimenpiteet-sivulla</a> näet listan olemassa olevista toiminnoista ja voit luoda ja muokata uusia toimintoja.

source: Below you can assign actions to run when certain role application related triggers happen. For example, you could email a user when their application is approved.
fi: Alla voit kytkeä käyttöön toimintoja, jotka käynnistetään, kun tiettyyn roolipyyntöön liittyvä trigger ilmenee. Esimerkiksi voit määritellä lähetettäväksi sähköpostiviestin käyttäjälle, kun hänen pyyntönsä on hyväksytty.

source: The <em>Apply for roles</em> module allows users to apply for roles from their user page and allows administrators to easily view, approve and delete role applications.
fi: <em>Apply for roles</em> -moduuli sallii käyttäjien pyytää rooleja käyttäjäsivullaan ja ylläpitäjien tarkastella, hylätä ja poistaa roolipyyntöjä.

source: Apply for role administration
fi: Apply for role -ylläpito

source: Administer which roles users can apply for.
fi: Määrittele, mitä rooleja käyttäjät voivat pyytää.

source: Manage role applications
fi: Hallinnoi roolipyyntöjä

source: View, approve and delete role applications.
fi: Tarkastele, hyväksy ja poista roolipyyntöjä.

source: Approve role application
fi: Hyväksy roolipyyntö

source: Deny role application
fi: Hylkää roolipyyntö

source: Remove role application
fi: Poista roolipyyntö

source: Removed
fi: Poistettu

source: Pending
fi: Odottaa käsittelyä

source: Approved
fi: Hyväksytty

source: Denied
fi: Hylätty

source: Unknown status
fi: Tuntematon tila

source: Select a role or roles
fi: Valitse rooli tai roolit

source: Select a role
fi: Valitse rooli

source: Apply
fi: Pyydä

source: No roles are available at this time.
fi: Yhtään roolia ei ole nyt tarjolla.

source: When a user submits an application for a role
fi: Kun käyttäjä lähettää roolipyynnön

source: When an admin approves a user's application for a role
fi: Kun ylläpitäjä hyväksyy käyttäjän roolipyynnön

source: When an admin denies a user's application for a role
fi: Kun ylläpitäjä hylkää käyttäjän roolipyynnön

source: When an admin deletes a user's application for a role
fi: Kun ylläpitäjä poistaa käyttäjän roolipyynnön

source: Your application was received for the following role:
fi: Olemme vastaanottaneet pyyntösi seuraavalle roolille:

source: Your applications were received for the following roles:
fi: Olemme vastaanottaneet roolipyyntösi:

source: There was a problem processing your application for the following role:
fi: Ilmeni ongelma tämän roolipyyntösi käsittelyssä:

source: There was a problem processing your applications for the following roles:
fi: Ilmeni ongelma seuraavien roolipyyntöjesi käsittelyssä:

source: administer apply for role
fi: Apply for role -moduulin hallinnointi

source: approve role applications
fi: roolipyyntöjen hyväksyminen

source: apply for roles
fi: roolien pyytäminen

source: Allows users to apply for roles.
fi: Salli käyttäjien pyytää rooleja

source: User management
fi: Käyttäjähallinta
